apply result 

```
terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - integrations/github in /Users/hamed/Desktop/tucows-code/terra-providor-extended/terraform-provider-github
│ 
│ The behavior may therefore not match any released version of the provider and
│ applying changes may cause the state to become incompatible with published
│ releases.
╵

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.forked_repo will be created
  + resource "github_repository" "forked_repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Test fork functionality with custom provider"
      + etag                        = (known after apply)
      + fork                        = true
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-fork-terraform"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = "TucowsTCX"
      + source_repo                 = "test-deleted"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false
    }

  # github_repository.second_fork will be created
  + resource "github_repository" "second_fork" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Second fork created from the first fork"
      + etag                        = (known after apply)
      + fork                        = true
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-fork-terraform-second"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = "TucowsTCX"
      + source_repo                 = "test-fork-terraform"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + fork_full_name        = (known after apply)
  + fork_name             = "test-fork-terraform"
  + fork_url              = (known after apply)
  + second_fork_full_name = (known after apply)
  + second_fork_name      = "test-fork-terraform-second"
  + second_fork_url       = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

github_repository.forked_repo: Creating...
github_repository.forked_repo: Creation complete after 4s [id=test-fork-terraform]
github_repository.second_fork: Creating...
github_repository.second_fork: Creation complete after 4s [id=test-fork-terraform-second]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

fork_full_name = "TucowsTCX/test-fork-terraform"
fork_name = "test-fork-terraform"
fork_url = "https://github.com/TucowsTCX/test-fork-terraform"
second_fork_full_name = "TucowsTCX/test-fork-terraform-second"
second_fork_name = "test-fork-terraform-second"
second_fork_url = "https://github.com/TucowsTCX/test-fork-terraform-second"


```